{"id":2697,"date":"2022-08-31T10:56:51","date_gmt":"2022-08-31T10:56:51","guid":{"rendered":"https:\/\/iarham.com\/?p=2697"},"modified":"2022-08-31T10:57:02","modified_gmt":"2022-08-31T10:57:02","slug":"procurement-analytics-and-data-science-an-interview-with-my-companys-vp","status":"publish","type":"post","link":"https:\/\/iarham.com\/procurement-analytics-and-data-science-an-interview-with-my-companys-vp\/","title":{"rendered":"Procurement Analytics and Data Science &#8211; An interview with my company&#8217;s VP"},"content":{"rendered":"<p>For some years now, business leaders have observed that advanced data analytics is bringing disruptive change to the field of procurement. While everyone agrees that these changes have important competitive implications, there is little agreement on a definition for procurement analytics, its benefits, or how best to establish these tools within an organization. We sat down with Geoff Farrell, Vice President of Procurement Analytics at Impendi, to get answers to important questions surrounding this emerging set of capabilities.<\/p>\n<p><strong>How do you define procurement analytics?<\/strong><br \/>\nProcurement analytics is best described as the process of turning data into insights that improve procurement decision making and, ultimately, performance across a wide range of financial and business metrics like lower direct\/indirect costs, reduced risk, and improved cash flow.<\/p>\n<p>For any procurement goal, the process starts by discovering where useful data exists and how to capture it. It goes beyond the vendor master and AP categorization to customize the data and apply opportunities for data enrichment.<\/p>\n<p>Once the data is organized, procurement analytics uses a variety of descriptive techniques to look deeply at: What happened? Metrics dashboards, internal benchmarking and variance analysis can reveal insights and generate hypotheses about the root causes of supply chain issues.<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-large wp-image-1838\" src=\"https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-analytics-journey-1024x475.png\" sizes=\"(max-width: 760px) 100vw, 760px\" srcset=\"https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-analytics-journey-1024x475.png 1024w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-analytics-journey-300x139.png 300w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-analytics-journey-768x356.png 768w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-analytics-journey-1536x712.png 1536w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-analytics-journey.png 1673w\" alt=\"Procurements Analytics Journey\" width=\"760\" height=\"353\" \/><\/p>\n<p>Armed with a good handle on what happened, procurement analytics can begin to use external data, benchmarks and supplier risk analysis to clarify: Why did it happen? Why are costs increasing? Why are we using this supplier? Why are we not hitting savings targets?<\/p>\n<p>Next, the procurement analytics journey can blend in more advanced tools to answer: What will happen next? While important, few companies are equipped with the tools to integrate demand forecasting, inflation modeling, or contract aging to indicate where the business is headed.<\/p>\n<p>The final step and payoff for the good use procurement analytics is reaching the prescriptive stage to address What should we do about it? Techniques such as scenario evaluation and simulations can model future performance and guide actions to optimize financial outcomes.<\/p>\n<p>A recent study of chief purchasing officers found that organizations using procurement analytics are five times more likely to generate savings than average performers. More than ever, C-suite leaders should be asking themselves: Is our data organized and tailored to our business? How advanced is our analytics? Are we using analytics to predict future outcomes and drive decisions?<\/p>\n<p><strong>How are companies using procurement analytics to capture value?<\/strong><br \/>\nBy far, the area getting the most traction in leader enterprises is spend and savings performance analytics. For these engagements, Impendi guides clients to think about the entire procurement savings lifecycle and to use the framework of find the savings, get the savings, and keep the savings. It’s a simple but useful approach to avoid losing focus and trying to boil the ocean.<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-large wp-image-1839\" src=\"https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-savings-lifecycle-1024x391.png\" sizes=\"(max-width: 760px) 100vw, 760px\" srcset=\"https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-savings-lifecycle-1024x391.png 1024w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-savings-lifecycle-300x114.png 300w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-savings-lifecycle-768x293.png 768w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-savings-lifecycle-1536x586.png 1536w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/procurement-savings-lifecycle.png 1677w\" alt=\"Procurement Savings Lifecycle\" width=\"760\" height=\"290\" \/><\/p>\n<p><strong>So how can analytics help you find savings opportunities?<\/strong><br \/>\nProcurement analytics can help companies to get the very best output from their data and gain more insight into the baseline spend. Along the way, practitioners need to confront and overcome three common issues that companies face with their data.<\/p>\n<ol>\n<li>Categorizations are not accurate or detailed enough.<\/li>\n<li>Taxonomy does not reflect the nuances of their business or industry<\/li>\n<li>Unactionable because front lines lack the insight, authority, or alignment to make changes.<\/li>\n<\/ol>\n<p>Procurement analytics can improve the approach to categorization. Descriptions of what was bought need look beyond a single field or vendor name. Techniques such as freeform text and natural language processing have become far more reliable at capturing what was purchased.<\/p>\n<p>New and reasonably priced analytic techniques are also available to mine information buried in PDF documents and supplement categorization of spend. Artificial intelligence and multiple categorization techniques can also play a role in improving data output.<\/p>\n<p>While data management tools are important, best practice categorization incorporates the knowledge of category experts to look at what the data says. These experts can identify if the data is wrong or if incremental knowledge can be layered into the analytics to establish a better description of what was bought.<\/p>\n<p>Getting the taxonomy right is critical. Rather than coding to some obscure, mass-produced starting point like United Nations Standard Products and Services Code or UNSPSC, it’s best to code to a ground up custom taxonomy so less is lost in translation.<\/p>\n<p>Taxonomy can be further refined with data from both internal and external sources such as Dun &amp; Bradstreet, Bureau Van Dijk, and Supplier.io. When you are rationalizing a supply base or reducing tail spend, it is important to know if a given supplier is contributing to your diversity program or if there is a high risk they will go out of business.<\/p>\n<p>Finally, data can be made more actionable by using ‘what-of’ analytics to evaluate the outcomes that certain actions might have. For example, what if I removed my payment terms out to 60 days, what would be the impact on working capital?<\/p>\n<p>To improve actionability, front lines need to couple spend analysis with category analytics based on item-level information. Here it is best not to look at rates, demand management, and spec rationalization without having the granular data. The insights that you can get from spend analysis and category analytics done together is far more holistic.<\/p>\n<p><strong>So, how does procurement analytics help with “getting the savings”?<\/strong><br \/>\nProcurement analytics greatly assists in the job of capturing the identified opportunities when it is used to provide managers with more accurate forecasting and improved visibility into the active capture projects. Best practice analytics goes beyond providing a snapshot or PMO update, it tracks how the project is changing, how managers are performing, and when forecasted savings will hit the bottom line.<\/p>\n<p>In an aggregate sense, analytics can give CPOs a view of the savings pipeline by stage, by status, by risk of completion. All this project information can be built in a custom Tableau dashboard that’s informative and not very expensive.<\/p>\n<p>Besides helping the procurement organization with a program and a process, we have found that analytics can assist in drafting support from real estate, risk management and other departments. By bringing visibility to the company-wide initiative and how it works, procurement can create partnerships that amplify the value capture beyond what was imagined.<\/p>\n<p><strong>What can procurement analytics do to help organizations keep their hard-earned savings?<\/strong><br \/>\nIdentified or contracted savings aren’t based on data from actual purchases, so they are not reliable. A recent Everest study found that only 22% of companies track projects based on “actual savings”. The result is that up to 30% of the contract savings are lost to leakage in the first year.<\/p>\n<p>So, how do we prevent that from happening? How do you know what your savings are? When will they hit the bottom line? How do we prevent leakage from occurring? Analytics can help.<\/p>\n<p>Measurement of realized savings must be done after a purchase is made. To track savings at a realized level, you need very detailed information. Often, that data doesn’t exist in any system. It’s with a supplier. So, how do you get the supplier’s data when it’s all in different formats and different categories?<\/p>\n<p>To solve this problem, Impendi created a category intelligence module. Using tools like Alteryx, we aggregate and merge data efficiently across formats to get actual purchase information and contract information within the system. Then, it can be pushed to Tableau or PowerBI to answer questions like: Why is there a deviation to forecast? Was the purchased item approved? Was the invoice price correct? Was the quantity different than spec? Was a discount missed?<\/p>\n<p><strong>For organizations that want to make greater use of procurement analytics, what roadblocks are they likely to encounter?<\/strong><br \/>\nClients start out in different places with respect to their data and use of analytics but as they mature in their journey, they tend to find issues in four categories.<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-large wp-image-1840\" src=\"https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/roadbloakc-to-procurement-analytics-1024x437.png\" sizes=\"(max-width: 760px) 100vw, 760px\" srcset=\"https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/roadbloakc-to-procurement-analytics-1024x437.png 1024w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/roadbloakc-to-procurement-analytics-300x128.png 300w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/roadbloakc-to-procurement-analytics-768x328.png 768w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/roadbloakc-to-procurement-analytics-1536x656.png 1536w, https:\/\/impendi.com\/wp-content\/uploads\/2022\/01\/roadbloakc-to-procurement-analytics.png 1592w\" alt=\"Roadblocks to procurement analytics\" width=\"760\" height=\"324\" \/><\/p>\n<ol>\n<li><strong>Data.<\/strong> Common issues here are not having access to the right data or the data that companies have is of poor quality.<\/li>\n<li><strong>Technology.<\/strong> Data is scattered in customized or legacy systems and the organization lacks the techniques to bring it together.<\/li>\n<li><strong>Process.<\/strong> Without an agreement about the analytics a company requires, companies can struggle with funding and getting the recourses to do the work.<\/li>\n<li><strong>Talent.<\/strong> Companies are often challenged to bring on people with the required techniques in data visualization, machine learning or natural language processing.<\/li>\n<\/ol>\n<p><strong>What are the essential procurement capabilities that organizations need to build to do analytics right?<\/strong><br \/>\nCompanies need three tightly integrated capabilities to maximize the impact of procurement analytics: data management, data analytics and domain expertise.<\/p>\n<p><strong>Data Management<\/strong><br \/>\nThis is the starting point for moving procurement analytics to the next level in your organization. Dedicated, full time experts are needed in data management that include data blending, de-duplication, normalization, translation, mapping, enrichment, and other activities to prepare data for ongoing analytics, reporting, and visualization.<\/p>\n<p><strong>Analytics &amp; Visualization<\/strong><br \/>\nExpertise in analytics and state-of-the-art BI technology to enable analyses and develop custom dashboards that provide compelling insights and support data-driven decisions. High-performing procurement organizations need people that likes to get into the details and to solve problems.<\/p>\n<p><strong>Domain Expertise<\/strong><br \/>\nDomain experts with experience in relevant categories or procurement processes who can advise on the components of the analytics process and viability of the analytics. These experts must be very tightly integrated with the data management and analytics players.<\/p>\n<p>Everyone’s in a different place on these questions, so just start with where you are at.<\/p>\n<p><strong>Becoming more sophisticated in procurement analytics requires a big investment of time and resources, right?<\/strong><br \/>\nNot really. The analytics landscape has changed, making it far easier for companies to build sophisticated analytics into their procurement toolbox. For example, computing in the cloud makes it inexpensive to get best-practice analytics. In terms of talent, most recent graduate students have had exposure to business analytics, and they know how to organize this work.<\/p>\n<p>We’re also seeing that data access and manipulation tools are continuing to proliferate. Years ago, we talked a lot about “garbage in, garbage out”. Now the data is better and there are ways to capture it repeatably. Visualization packages once considered obscure and rare are readily available and simple to use. With better data, the type of analytics that you can do are much more powerful and impactful.<\/p>\n<p><strong>For companies just getting started, how would you suggest organizing this effort within their management structure?<\/strong><br \/>\nWell, we have certainly seen ways of organizing the process that fall short of the mark. CPO-led programs tend not to work because they are too busy to integrate all the required parts of the process. We’ve also seen companies push leadership too far down into the organization to managers without the clout to bring everything together.<\/p>\n<p>We’ve also seen CIOs, especially in the bigger companies, say “All analytics reports to me.” That usually does not work out because IT resources don’t know procurement and how messy that data can be. In most situations, we recommend that the internal and external resources report into wherever they can be tightly integrated—usually the procurement lead.<\/p>\n<p>The data management role is key. Talent good with technology is hard to find and even harder to keep. We’ve had good luck offshoring and outsourcing these tasks, but you need a good and trusted partner. For the analytics role there is a need to build the initial framework and we’ve seen success with using an outside partner to get to an 80% solution, then use internal resources to customize and develop dashboards.<\/p>\n<p><strong>About Impendi:<\/strong><br \/>\nImpendi is a leading strategic sourcing resource relied upon by the world’s leading Private Equity operators &amp; Fortune 1000 companies to find, get, and keep value from supply chains. We act as a force multiplier transferring functional capabilities, analytic solutions, best practice processes, and executional excellence to our clients’ unique sourcing challenges and value capture opportunities.<\/p>\n<p><strong>About Geoff Farrell<\/strong><br \/>\nGeoff has a proven track record during his 25+ years of industry experience building top-performing teams and bringing innovative analytics solutions to market. He has organized and directed support for over 300 companies globally with procurement analytics initiatives, including spend, category, supply chain risk. Geoff leads the Procurement Analytics team at Impendi.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For some years now, business leaders have observed that advanced data analytics is bringing disruptive change to the field of procurement. While everyone agrees that these changes have important competitive implications, there is little agreement on a definition for procurement analytics, its benefits, or how best to establish these tools within an organization. We sat &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/iarham.com\/procurement-analytics-and-data-science-an-interview-with-my-companys-vp\/\"> <span class=\"screen-reader-text\">Procurement Analytics and Data Science &#8211; An interview with my company&#8217;s VP<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/posts\/2697"}],"collection":[{"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/comments?post=2697"}],"version-history":[{"count":0,"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/posts\/2697\/revisions"}],"wp:attachment":[{"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/media?parent=2697"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/categories?post=2697"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/iarham.com\/wp-json\/wp\/v2\/tags?post=2697"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}